---
kind: type
id: T:Autodesk.Revit.DB.ReloadSwapOutInfo
source: html/a7af8ca1-4e5b-34a0-831e-239b3c56cbb8.htm
---
# Autodesk.Revit.DB.ReloadSwapOutInfo

This object contains information about fabrication parts swapped out during reload.

## Syntax (C#)
```csharp
public class ReloadSwapOutInfo : IDisposable
```